tollsimy/ESP32-AS7341/components/AS7341/ESP32_AS7341.c
/*!
 *  @file ESP32_AS7341.c
 *
 * 	I2C Driver for the Library for the AS7341 11-Channel Spectral Sensor
 *
 * 	This is a library for the Adafruit AS7341 breakout:
 * 	https://www.adafruit.com/product/4698
 *
 * 	Adafruit invests time and resources providing this open source code,
 *  please support Adafruit and open-source hardware by purchasing products from
 * 	Adafruit!
 *
 *  Simone Tollardo - ESP32 C library porting (2022)
 *
 *  Copyright 2020 Bryan Siepert for Adafruit Industries
 *  Copyright 2022 Simone Tollardo
 *
 * 	BSD (see license.txt)
 */

/* TODO: Check if Gain register AS7341_CFG1 change values when AGC enabled
or AGC changes only ASTATUS register AS7341_ASTATUS
*/


#include "ESP32_AS7341.h"
#include <esp_err.h>
#include <esp_log.h>
#include <freertos/FreeRTOS.h>

static const char* TAG="ESP32_AS7341";

static const char* ALREADY_INIT="Already initialized";
static const char* NOT_INIT="Not initialized";

// ---------------- I2C AUXILIARY FUNCTIONS ----------------

/**
 *  @brief  write an 8 bit value over I2C
 *  @param  reg
 *  @param  value
 */
static void write8(ESP32_AS7341 *AS,uint8_t reg, uint8_t value) {
    uint8_t buffer[2] = {reg, value};
    ESP_ERROR_CHECK(i2c_master_write_to_device(AS->i2c_port, AS7341_ADDRESS, buffer, 2, 1000 / portTICK_PERIOD_MS));
}

/**
 *  @brief  write a 16 bit value over I2C
 *  @param  reg
 *  @param  value
 */
static void write16(ESP32_AS7341 *AS, uint8_t reg, uint16_t value) {

    uint8_t buffer[3] = {reg, (uint8_t)(value), (uint8_t)(value >> 8)};
    ESP_ERROR_CHECK(i2c_master_write_to_device(AS->i2c_port, AS7341_ADDRESS, buffer, 3, 1000 / portTICK_PERIOD_MS));
}

/**
 *  @brief  Reads an 8 bit value over I2C
 *  @param  reg
 *  @return value
 */
static uint8_t read8(ESP32_AS7341 *AS, uint8_t reg) {
    uint8_t buffer[1] = {reg};
    ESP_ERROR_CHECK(i2c_master_write_to_device(AS->i2c_port, AS7341_ADDRESS, buffer, 1, 1000 / portTICK_PERIOD_MS));
    ESP_ERROR_CHECK(i2c_master_read_from_device(AS->i2c_port, AS7341_ADDRESS, buffer, 1, 1000 / portTICK_PERIOD_MS));
    return buffer[0];
}

/**
 *  @brief  Reads a 16 bit value over I2C
 *  @param  reg
 *  @return value
 */
static uint16_t read16(ESP32_AS7341 *AS, uint8_t reg) {
    uint8_t buffer[2] = {reg, 0};
    ESP_ERROR_CHECK(i2c_master_write_to_device(AS->i2c_port, AS7341_ADDRESS, buffer, 1, 1000 / portTICK_PERIOD_MS));
    ESP_ERROR_CHECK(i2c_master_read_from_device(AS->i2c_port, AS7341_ADDRESS, buffer, 2, 1000 / portTICK_PERIOD_MS));
    return buffer[0] | (buffer[1] << 8);
}

/**
 *  @brief  Reads <SIZE> bytes over I2C
 *  @param  reg
 *  @param  data pointer to the data buffer
 *  @param  size number of bytes to read
 *  @return value
 */
static void read_data(ESP32_AS7341 *AS, uint8_t reg, uint8_t *data, size_t size) {
    uint8_t buffer[1] = {reg};
    ESP_ERROR_CHECK(i2c_master_write_to_device(AS->i2c_port, AS7341_ADDRESS, buffer, 1, 1000 / portTICK_PERIOD_MS));
    ESP_ERROR_CHECK(i2c_master_read_from_device(AS->i2c_port, AS7341_ADDRESS, data, size, 1000 / portTICK_PERIOD_MS));
}

/**
 * @brief Write bits in a register
 *
 * @param reg register to write to
 * @param mask mask to apply
 * @param value value to write
 */
static void writeBits(ESP32_AS7341 *AS, uint8_t reg, uint8_t mask, uint8_t value) {
    uint8_t tmp = read8(AS, reg);
    tmp &= ~mask;
    tmp |= (value & mask);
    write8(AS, reg, tmp);
}

// ---------------- INITIALIZATION FUNCTIONS ----------------

/**
 *  @brief  Initializes the AS7341 sensor
 *  @param  AS Pointer to the AS7341 sensor structure
 *  @return void
 */
esp_err_t AS_init(ESP32_AS7341 *AS, uint8_t i2c_port) {
    assert(AS->init!=true && ALREADY_INIT);
    AS->i2c_port=i2c_port;
    //Load default values
    AS->mode = AS7341_MODE_SPM;
    AS->ATIME = 29;
    AS->ASTEP = 599;
    AS->gain = AS7341_GAIN_256X;
    AS->APERS = AS7341_INT_COUNT_ALL;
    AS->LT = 0;
    AS->HT = 0;
    AS->TH_CH = AS7341_ADC_CHANNEL_0;
    AS->gpio_dir = AS7341_GPIO_OUTPUT;
    AS->gpio_inv = false;
    AS->out_gpio_value = 1;
    AS->reg_bank = 0;

    /* Make sure we're actually connected */
    uint8_t ID = read8(AS, AS7341_ID) >> 2;
    if (ID != AS7341_CHIP_ID) {
        ESP_LOGE(TAG, "AS7341 not found, ID 0x%02x != 0x09", ID);
        return ESP_FAIL;
    }
    AS->init = true;

    /* Set default values */
    AS_setMode(AS, AS->mode);
    AS_setATIME(AS, AS->ATIME);
    AS_setASTEP(AS, AS->ASTEP);
    AS_setGain(AS, AS->gain);
    AS_setAPERS(AS, AS->APERS);
    AS_setLowThreshold(AS, AS->LT);
    AS_setHighThreshold(AS, AS->HT);
    AS_setThresholdChannel(AS, AS->TH_CH);
    AS_setGPIO(AS, AS->gpio_dir, AS->gpio_inv, AS->out_gpio_value);
    AS_setBank(AS, AS->reg_bank);

    AS_enable(AS);
    return ESP_OK;
}

/**
 *  @brief  Power On the device
 *  @param  AS Pointer to the AS7341 structure
 *  @return void
 */
void AS_enable(ESP32_AS7341 *AS){
    assert(AS->init==true && NOT_INIT);
    writeBits(AS, AS7341_ENABLE, 0x01, 0x01);   //PON=1
    AS->enabled=true;
}

/**
 * @brief Disable Spectral reading, flicker detection, and power
 *
 * */
void AS_disableAll(ESP32_AS7341 *AS) {
    assert(AS->init==true && NOT_INIT);
    writeBits(AS, AS7341_ENABLE, 0x5b, 0x00);  //PON=0, SP_EN=0, W_EN=0, SMUX_EN=0, FD_EN=0
    AS->enabled=0;
}

/**
 * @brief Enables measurement of spectral data
 *
 * @param enable_measurement true: enabled false: disabled
 * @return void
 */
void AS_enableSpectralMeasurement(ESP32_AS7341 *AS, bool enable_measurement) {
    assert(AS->init==true && NOT_INIT);
    writeBits(AS, AS7341_ENABLE, 0x02, (uint8_t)enable_measurement << 1); //SP_EN=enable_measurement
}

// ---------------- CONFIGURATION FUNCTIONS ----------------

/**
 *  @brief  Set device mode: SPM, SYNS, SYND
 *  @param  AS Pointer to the AS7341 structure
 *  @param  mode
 *  @return void
 */
void AS_setMode(ESP32_AS7341 *AS, as7341_mode_t mode){
    assert(AS->init==true && NOT_INIT);
    writeBits(AS, AS7341_CONFIG, 0x03, (uint8_t)mode);
    AS->mode = mode;
}

/**
 * @brief Sets the integration time step count
 * @param AS Pointer to the AS7341 structure
 * @param ATIME Integration time step count
 * @return void
 */
void AS_setATIME(ESP32_AS7341 *AS, uint8_t ATIME){
    assert(AS->init==true && NOT_INIT);
    write8(AS, AS7341_ATIME, ATIME);
    AS->ATIME = ATIME;
}

/**
 * @brief Sets the integration time step size
 * @param AS Pointer to the AS7341 structure
 * @param ASTEP Integration time step size
 * @return void
 */
void AS_setASTEP(ESP32_AS7341 *AS, uint16_t ASTEP){
    assert(AS->init==true && NOT_INIT);
    write16(AS, AS7341_ASTEP_L, ASTEP);
    AS->ASTEP = ASTEP;
}

/**
 * @brief Sets the ADC gain multiplier
 * @param AS Pointer to the AS7341 structure
 * @param gain ADC gain multiplier
 * @return void
 */
void AS_setGain(ESP32_AS7341 *AS, as7341_gain_t gain){
    assert(AS->init==true && NOT_INIT);
    writeBits(AS, AS7341_CFG1, 0x1F, (uint8_t)gain);
    AS->gain = gain;
}

// Spectral Interrupt Persistence.
// Defines a filter for the number of consecutive
// occurrences that spectral data must remain outside
// the threshold range between SP_TH_L and
// SP_TH_H before an interrupt is generated. The
// spectral data channel used for the persistence filter
// is set by SP_TH_CHANNEL. Any sample that is
// inside the threshold range resets the counter to 0.
/**
 * @brief Sets the number of times an interrupt threshold must be exceeded
 * before an interrupt is triggered
 * @param AS Pointer to the AS7341 structure
 * @param cycle_count The number of cycles to trigger an interrupt
 * @return void
 */
void AS_setAPERS(ESP32_AS7341 *AS, as7341_int_cycle_count_t APERS){
    assert(AS->init==true && NOT_INIT);
    writeBits(AS, AS7341_PERS, 0x0F, (uint8_t)APERS);
    AS->APERS = APERS;
}

/**
 * @brief Sets the threshold below which spectral measurements will trigger
 * interrupts when the APERS count is reached
 * @param AS Pointer to the AS7341 structure
 * @param LT The low threshold
 * @return void
 */
void AS_setLowThreshold(ESP32_AS7341 *AS, uint16_t threshold){
    assert(AS->init==true && NOT_INIT);
    write16(AS, AS7341_SP_LOW_TH_L, threshold);
    AS->LT = threshold;
}

/**
 * @brief Sets the threshold above which spectral measurements will trigger
 * interrupts when the APERS count is reached
 * @param AS Pointer to the AS7341 structure
 * @param HT The high threshold
 * @return void
 */
void AS_setHighThreshold(ESP32_AS7341 *AS, uint16_t threshold){
    assert(AS->init==true && NOT_INIT);
    write16(AS, AS7341_SP_HIGH_TH_L, threshold);
    AS->HT = threshold;
}

/**
 * @brief Set the ADC channel to use for spectral thresholds including
 * interrupts, automatic gain control, and persistance settings
 * @param AS Pointer to the AS7341 structure
 * @param channel The channel to use for spectral thresholds. Must be a
 * as7341_adc_channel_t **except for** `AS7341_ADC_CHANNEL_5`
 * @return void
 */
void AS_setThresholdChannel(ESP32_AS7341 *AS, as7341_adc_channel_t channel){
    assert(AS->init==true && NOT_INIT);
    if (channel == AS7341_ADC_CHANNEL_5) {
        ESP_LOGE(TAG, "AS7341_ADC_CHANNEL_5 is not a valid channel for spectral thresholds");
    }
    writeBits(AS, AS7341_CFG12, 0x07, (uint8_t)channel);
}

/**
 * @brief Set the GPIO : direction, Polarity and value.
 *
 * @param dir: the GPIO direction.
 * @param out_gpio_inverted: the GPIO polarity (inverts the logic of the GPIO)
 * @param val: the GPIO output value (if GPIO is set to input it will be written
 * but ignored until the next write to the GPIO direction register)
 *
 * @return void
 */
void AS_setGPIO(ESP32_AS7341 *AS, as7341_gpio_dir_t dir, bool gpio_inverted, bool out_gpio_value){
    assert(AS->init==true && NOT_INIT);
    uint8_t buffer;
    buffer = (uint8_t)(out_gpio_value << 1) | (uint8_t)(dir <<2) |  (uint8_t)(gpio_inverted << 3);
    writeBits(AS, AS7341_GPIO2, 0x0F, buffer);

