tollsimy/ESP32-AS7341/components/AS7341/ESP32_AS7341.c
    AS->gpio_dir = dir;
    AS->gpio_inv = gpio_inverted;
    AS->out_gpio_value = out_gpio_value;
}

/**
 * @brief Sets the active register bank
 *
 * The AS7341 uses banks to organize the register making it nescessary to set
 * the correct bank to access a register.
 *
 * @param sel
 * true: Register access to register 0x60 to 0x74
 * false: Register access to register 0x80 and above
 *
 * @return void
 */
void AS_setBank(ESP32_AS7341 *AS, bool sel) {
    assert(AS->init==true && NOT_INIT);
    writeBits(AS, AS7341_CFG0, 0x10, (uint8_t)sel << 4);
    AS->reg_bank=sel;
}

// ---------------- SENSOR READING AUXILIARY FUNCTIONS ----------------

/**
 * @brief Configure SMUX for sensors F1-4, Clear and NIR (6 ADC Channels available)
 * See AS7341_EvalSW_Reflection_v1-26-3.zip for explanations
 */
static void setup_F1F4_Clear_NIR(ESP32_AS7341 *AS) {
    // SMUX Config for F1,F2,F3,F4,NIR,Clear
    write8(AS, 0x00, 0x30); // F3 left set to ADC2
    write8(AS, 0x01, 0x01); // F1 left set to ADC0
    write8(AS, 0x02, 0x00); // Reserved or disabled
    write8(AS, 0x03, 0x00); // F8 left disabled
    write8(AS, 0x04, 0x00); // F6 left disabled
    write8(AS, 0x05, 0x42); // F4 left connected to ADC3/f2 left connected to ADC1
    write8(AS, 0x06, 0x00); // F5 left disbled
    write8(AS, 0x07, 0x00); // F7 left disbled
    write8(AS, 0x08, 0x50); // CLEAR connected to ADC4
    write8(AS, 0x09, 0x00); // F5 right disabled
    write8(AS, 0x0A, 0x00); // F7 right disabled
    write8(AS, 0x0B, 0x00); // Reserved or disabled
    write8(AS, 0x0C, 0x20); // F2 right connected to ADC1
    write8(AS, 0x0D, 0x04); // F4 right connected to ADC3
    write8(AS, 0x0E, 0x00); // F6/F8 right disabled
    write8(AS, 0x0F, 0x30); // F3 right connected to AD2
    write8(AS, 0x10, 0x01); // F1 right connected to AD0
    write8(AS, 0x11, 0x50); // CLEAR right connected to AD4
    write8(AS, 0x12, 0x00); // Reserved or disabled
    write8(AS, 0x13, 0x06); // NIR connected to ADC5
}

/**
 * @brief Configure SMUX for sensors F5-8, Clear and NIR (6 ADC Channels available)
 * See AS7341_EvalSW_Reflection_v1-26-3.zip for explanations
 */
static void setup_F5F8_Clear_NIR(ESP32_AS7341 *AS) {
    // SMUX Config for F5,F6,F7,F8,NIR,Clear
    write8(AS, 0x00, 0x00); // F3 left disable
    write8(AS, 0x01, 0x00); // F1 left disable
    write8(AS, 0x02, 0x00); // reserved/disable
    write8(AS, 0x03, 0x40); // F8 left connected to ADC3
    write8(AS, 0x04, 0x02); // F6 left connected to ADC1
    write8(AS, 0x05, 0x00); // F4/ F2 disabled
    write8(AS, 0x06, 0x10); // F5 left connected to ADC0
    write8(AS, 0x07, 0x03); // F7 left connected to ADC2
    write8(AS, 0x08, 0x50); // CLEAR Connected to ADC4
    write8(AS, 0x09, 0x10); // F5 right connected to ADC0
    write8(AS, 0x0A, 0x03); // F7 right connected to ADC2
    write8(AS, 0x0B, 0x00); // Reserved or disabled
    write8(AS, 0x0C, 0x00); // F2 right disabled
    write8(AS, 0x0D, 0x00); // F4 right disabled
    write8(AS, 0x0E, 0x24); // F8 right connected to ADC2/ F6 right connected to ADC1
    write8(AS, 0x0F, 0x00); // F3 right disabled
    write8(AS, 0x10, 0x00); // F1 right disabled
    write8(AS, 0x11, 0x50); // CLEAR right connected to AD4
    write8(AS, 0x12, 0x00); // Reserved or disabled
    write8(AS, 0x13, 0x06); // NIR connected to ADC5
}

//TODO flicker not implemented yet
// /**
//  * @brief Configure SMUX for flicker detection
//  * See AS7341_EvalSW_Reflection_v1-26-3.zip for explanations
//  */
// static void FDConfig(ESP32_AS7341 *AS) {
//     // SMUX Config for Flicker- register (0x13)left set to ADC6 for flicker
//     // detection
//     write8(AS, 0x00, 0x00);  // disabled
//     write8(AS, 0x01, 0x00);  // disabled
//     write8(AS, 0x02, 0x00);  // reserved/disabled
//     write8(AS, 0x03, 0x00);  // disabled
//     write8(AS, 0x04, 0x00);  // disabled
//     write8(AS, 0x05, 0x00);  // disabled
//     write8(AS, 0x06, 0x00);  // disabled
//     write8(AS, 0x07, 0x00);  // disabled
//     write8(AS, 0x08, 0x00);  // disabled
//     write8(AS, 0x09, 0x00);  // disabled
//     write8(AS, 0x0A, 0x00);  // disabled
//     write8(AS, 0x0B, 0x00);  // Reserved or disabled
//     write8(AS, 0x0C, 0x00);  // disabled
//     write8(AS, 0x0D, 0x00);  // disabled
//     write8(AS, 0x0E, 0x00);  // disabled
//     write8(AS, 0x0F, 0x00);  // disabled
//     write8(AS, 0x10, 0x00);  // disabled
//     write8(AS, 0x11, 0x00);  // disabled
//     write8(AS, 0x12, 0x00);  // Reserved or disabled
//     write8(AS, 0x13, 0x60); // Flicker connected to ADC5 to left of 0x13
// }

static void setSMUXCommand(ESP32_AS7341 *AS, as7341_smux_cmd_t command) {
    writeBits(AS, AS7341_CFG6, 0x18, (uint8_t)(command << 3));
}

static void enableSMUX(ESP32_AS7341 *AS) {

    writeBits(AS, AS7341_ENABLE, 0x10, 0x01 << 4);

    // Arbitrary value, but if it takes 1000 milliseconds then something is wrong
    int timeOut = 1000;
    int count = 0;
    // wait for SMUX_EN bit to be reset (after SMUX operation) or timeout
    while (!!((read8(AS, AS7341_ENABLE) & 0x10) >> 4) && count < timeOut) {
        vTaskDelay(1/portTICK_PERIOD_MS);
        count++;
    }
    if (count >= timeOut) {
        ESP_LOGE(TAG, "SMUX enable timeout");
    }
}

static void setSMUXLowChannels(ESP32_AS7341 *AS, bool lowChan) {
    AS_enableSpectralMeasurement(AS, false);
    setSMUXCommand(AS, AS7341_SMUX_CMD_WRITE);
    if (lowChan) {
        setup_F1F4_Clear_NIR(AS);
    } else {
        setup_F5F8_Clear_NIR(AS);
    }
    enableSMUX(AS);
}

/**
 * @brief Check if spectral measurement is completed
 *
 * @return true: success false: failure
 */
bool AS_getIsDataReady(ESP32_AS7341 *AS) {
    assert(AS->init==true && NOT_INIT);
    //Check if AVALID bit is set
    return !!((read8(AS, AS7341_STATUS2) & 0x40) >> 6);
}

/**
 * @brief Delay while waiting for data, with option to time out and recover
 *
 * @param waitTime the maximum amount of time to wait
 * @return void
 */
void AS_delayForData(ESP32_AS7341 *AS, int waitTime) {
    assert(AS->init==true && NOT_INIT);
    if (waitTime == 0) // Wait forever
    {
        while (!AS_getIsDataReady(AS)) {
        vTaskDelay(1/portTICK_PERIOD_MS);
        }
        return;
    }
    if (waitTime > 0) // Wait for that many milliseconds
    {
        uint32_t elapsedMillis = 0;
        while (!AS_getIsDataReady(AS) && elapsedMillis < waitTime) {
        vTaskDelay(1/portTICK_PERIOD_MS);
        elapsedMillis++;
        }
        ESP_LOGE(TAG, "Data not ready after %d milliseconds", elapsedMillis);
    }
    if (waitTime < 0) {
        // For future use?
        return;
    }
}

// ---------------- SENSOR READING FUNCTIONS ----------------

/**
 * @brief Update the ADC data in the AS structure for a given **ADC channel**
 * @param AS Pointer to the AS7341 structure
 * @param channel The ADC channel to read
 * @return void
 */
void AS_read_ADC_Channel(ESP32_AS7341 *AS, as7341_adc_channel_t channel) {
    assert(AS->init==true && NOT_INIT);
    // each channel has two bytes, so offset by two for each next channel
    AS->data[channel]=read16(AS, AS7341_CH0_DATA_L + 2 * channel);
}

/**
 * @brief Update the ADC data in the AS structure for all **Spectral
 * channels F1-8, Clear and NIR**, not ADC Channels!
 * @param AS Pointer to the AS7341 structure
 * @return void
 */
void AS_readAllChannels(ESP32_AS7341 *AS) {
    assert(AS->init==true && NOT_INIT);
    setSMUXLowChannels(AS, true);             // Configure SMUX to read low channels
    AS_enableSpectralMeasurement(AS, true);   // Start integration
    AS_delayForData(AS, 0);                   // I'll wait for you for all time

    uint8_t readings_buffer[12];
    read_data(AS, AS7341_CH0_DATA_L, readings_buffer, 12);  // Read all 12 bytes
    // Convert the readings to uint16_t and store in the AS structure
    AS->data[0] = readings_buffer[0] | readings_buffer[1] << 8;
    AS->data[1] = readings_buffer[2] | readings_buffer[3] << 8;
    AS->data[2] = readings_buffer[4] | readings_buffer[5] << 8;
    AS->data[3] = readings_buffer[6] | readings_buffer[7] << 8;
    AS->data[4] = readings_buffer[8] | readings_buffer[9] << 8;
    AS->data[5] = readings_buffer[10] | readings_buffer[11] << 8;

    setSMUXLowChannels(AS, false);            // Configure SMUX to read high channels
    AS_enableSpectralMeasurement(AS, true);   // Start integration
    AS_delayForData(AS, 0);                   // I'll wait for you for all time

