tollsimy/ESP32-AS7341/components/AS7341/ESP32_AS7341.c
    read_data(AS, AS7341_CH0_DATA_L, readings_buffer, 12);
    // Convert the readings to uint16_t and store in the AS structure
    AS->data[6] = readings_buffer[0] | readings_buffer[1] << 8;
    AS->data[7] = readings_buffer[2] | readings_buffer[3] << 8;
    AS->data[8] = readings_buffer[4] | readings_buffer[5] << 8;
    AS->data[9] = readings_buffer[6] | readings_buffer[7] << 8;
    AS->data[10] = readings_buffer[8] | readings_buffer[9] << 8;
    AS->data[11] = readings_buffer[10] | readings_buffer[11] << 8;
}

/**
 * @brief Returns the reading data for the specified color channel taken
 * from the AS Strcture
 *
 *  call `readAllChannels` before reading to update the stored readings
 *
 * @param AS Pointer to the AS7341 structure
 * @param channel The color sensor channel to read
 * @return uint16_t The measured data for the selected sensor channel, 
 * returns 0 if struct not init
 */
uint16_t AS_getChannel(ESP32_AS7341 *AS, as7341_color_channel_t channel) {
    assert(AS->init==true && NOT_INIT);
    return AS->data[channel];
}

/**
 * @brief Fill the data argument with all the readings taken from the AS
 * structure
 *
 *  call `readAllChannels` before reading to update the stored readings
 *
 * @param AS Pointer to the AS7341 structure
 * @param data Array of 12 uint16_t
 * @return void
 */
void AS_getAllChannels(ESP32_AS7341 *AS, uint16_t data[12]) {
    assert(AS->init==true && NOT_INIT);
    data[0] = AS->data[0];
    data[1] = AS->data[1];
    data[2] = AS->data[2];
    data[3] = AS->data[3];
    data[4] = AS->data[4];
    data[5] = AS->data[5];
    data[6] = AS->data[6];
    data[7] = AS->data[7];
    data[8] = AS->data[8];
    data[9] = AS->data[9];
    data[10] = AS->data[10];
    data[11] = AS->data[11];
}

// ---------------- NOT IMPLEMENTED FUNCTIONS ----------------

// // maybe return a typedef enum
// /**
//  * @brief Returns the flicker detection status
//  *
//  * @return int8_t
//  */
// int8_t getFlickerDetectStatus(void) {
//   Adafruit_BusIO_Register flicker_val =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_FD_STATUS);
//   return (int8_t)flicker_val.read();
// }

// bool enableFlickerDetection(bool enable_fd) {

//   Adafruit_BusIO_Register enable_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_ENABLE);
//   Adafruit_BusIO_RegisterBits fd_enable_bit =
//       Adafruit_BusIO_RegisterBits(&enable_reg, 1, 6);
//   return fd_enable_bit.write(enable_fd);
// }

// /**
//  * @brief Enable control of an attached LED on the LDR pin
//  *
//  * @param enable_led true: LED enabled false: LED disabled
//  * @return true: success false: failure
//  */
// bool enableLED(bool enable_led) {
//   Adafruit_BusIO_Register config_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_CONFIG);
//   // Enables control of the LED via the LDR pin
//   // 1=control enabled 0 = control disabled
//   Adafruit_BusIO_RegisterBits led_sel_bit =
//       Adafruit_BusIO_RegisterBits(&config_reg, 1, 3);

//   Adafruit_BusIO_Register led_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_LED);
//   // turns the LED on or off
//   Adafruit_BusIO_RegisterBits led_act_bit =
//       Adafruit_BusIO_RegisterBits(&led_reg, 1, 7);

//   setBank(true); // Access 0x60-0x74
//   bool result = led_sel_bit.write(enable_led) && led_act_bit.write(enable_led);
//   setBank(false); // Access registers 0x80 and above (default)
//   return result;
// }

// /**
//  * @brief Set the current limit for the LED
//  *
//  * @param led_current_ma the value to set in milliamps. With a minimum of 4. Any
//  * amount under 4 will be rounded up to 4
//  *
//  * Range is 4mA to 258mA
//  * @return true: success false: failure
//  */
// bool setLEDCurrent(uint16_t led_current_ma) {
//   // check within permissible range
//   if (led_current_ma > 258) {
//     return false;
//   }
//   if (led_current_ma < 4) {
//     led_current_ma = 4;
//   }
//   setBank(true); // Access 0x60 0x74

//   Adafruit_BusIO_Register led_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_LED);

//   // true = led on , false = off
//   Adafruit_BusIO_RegisterBits led_current_bits =
//       Adafruit_BusIO_RegisterBits(&led_reg, 7, 0);

//   bool result = led_current_bits.write((uint8_t)((led_current_ma - 4) / 2));
//   setBank(false); // Access registers 0x80 and above (default)
//   return result;
// }

// /**
//  * @brief Enable Interrupts based on spectral measurements
//  *
//  * @param enable_int true: enable false: disable
//  * @return true: success false: falure
//  */
// bool enableSpectralInterrupt(bool enable_int) {
//   Adafruit_BusIO_Register int_enable_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_INTENAB);
//   Adafruit_BusIO_RegisterBits sp_int_bit =
//       Adafruit_BusIO_RegisterBits(&int_enable_reg, 1, 3);
//   return sp_int_bit.write(enable_int);
// }

// /**
//  * @brief Enabled system interrupts
//  *
//  * @param enable_int Set to true to enable system interrupts
//  * @return true: success false: failure
//  */
// bool enableSystemInterrupt(bool enable_int) {
//   Adafruit_BusIO_Register int_enable_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_INTENAB);
//   Adafruit_BusIO_RegisterBits sien_int_bit =
//       Adafruit_BusIO_RegisterBits(&int_enable_reg, 1, 0);
//   return sien_int_bit.write(enable_int);
// }


// /**
//  * @brief Returns the current value of the Interupt status register
//  *
//  * @return uint8_t
//  */
// uint8_t getInterruptStatus(void) {
//   Adafruit_BusIO_Register int_status_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_STATUS);
//   return (uint8_t)int_status_reg.read();
// }

// /**
//  * @brief Returns the status of the spectral measurement threshold interrupts
//  *
//  * @return true: interrupt triggered false: interrupt not triggered
//  */
// bool spectralInterruptTriggered(void) {
//   Adafruit_BusIO_Register int_status_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_STATUS);
//   Adafruit_BusIO_RegisterBits aint_bit =
//       Adafruit_BusIO_RegisterBits(&int_status_reg, 1, 3);

