tollsimy/ESP32-AS7341/components/AS7341/ESP32_AS7341.c
//   return aint_bit.read();
// }

// /**
//  * @brief Clear the interrupt status register
//  *
//  * @return true: success false: failure
//  */
// bool clearInterruptStatus(void) {
//   Adafruit_BusIO_Register int_status_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_STATUS);

//   return int_status_reg.write(0xFF);
// }

// /**
//  * @brief The current state of the spectral measurement interrupt status
//  * register
//  *
//  * @return uint8_t The current status register
//  */
// uint8_t spectralInterruptSource(void) {
//   Adafruit_BusIO_Register status3_reg =
//       Adafruit_BusIO_Register(i2c_dev, AS7341_STATUS3);

//   uint8_t spectral_int_source = status3_reg.read();
//   last_spectral_int_source = spectral_int_source;
//   return spectral_int_source;
// }

// /**
//  * @brief The status of the low threshold interrupt
//  *
//  * @return true: low interrupt triggered false: interrupt not triggered
//  */
// bool spectralLowTriggered(void) {
//   return (last_spectral_int_source & AS7341_SPECTRAL_INT_LOW_MSK > 0);
// }

// /**
//  * @brief The status of the high threshold interrupt
//  *
//  * @return true: high interrupt triggered false: interrupt not triggered
//  */
// bool spectralHighTriggered(void) {
//   return (last_spectral_int_source & AS7341_SPECTRAL_INT_HIGH_MSK > 0);
// }

// /**
//  * @brief Detect a flickering light
//  * @return The frequency of a detected flicker or 1 if a flicker of
//  * unknown frequency is detected
//  */
// uint16_t detectFlickerHz(void) {
//   bool isEnabled = true;
//   bool isFdmeasReady = false;

//   // disable everything; Flicker detect, smux, wait, spectral, power
//   disableAll();
//   // re-enable power
//   powerEnable(true);

//   // Write SMUX configuration from RAM to set SMUX chain registers (Write 0x10
//   // to CFG6)
//   setSMUXCommand(AS7341_SMUX_CMD_WRITE);

//   // Write new configuration to all the 20 registers for detecting Flicker
//   FDConfig();

//   // Start SMUX command
//   enableSMUX();

//   // Enable SP_EN bit
//   enableSpectralMeasurement(true);

//   // Enable flicker detection bit
//   writeRegister(byte(AS7341_ENABLE), byte(0x41));
//   delay(500); // SF 2020-08-12 Does this really need to be so long?
//   uint16_t flicker_status = getFlickerDetectStatus();
//   enableFlickerDetection(false);
//   switch (flicker_status) {
//   case 44:
//     return 1;
//   case 45:
//     return 100;
//   case 46:
//     return 120;
//   default:
//     return 0;
//   }
// }

// ---------------- GET VALUES FUNCTIONS ----------------

/**
 * @brief Reads the ITIME value from AS, used to calculate integration time
 * in SYND mode
 * @return ITIME value
 */
static uint32_t AS_getITIME(ESP32_AS7341 *AS){
    assert(AS->init==true && NOT_INIT);
    uint8_t buffer[3];
    buffer[0]=read8(AS, AS7341_ITIME_L);
    buffer[1]=read8(AS, AS7341_ITIME_M);
    buffer[2]=read8(AS, AS7341_ITIME_H);
    return (uint32_t)(buffer[2]<<16)|(uint32_t)(buffer[1]<<8)|(uint32_t)buffer[0];
}

/**
 * @brief Returns the integration time
 *
 * The integration time is `(ATIME + 1) * (ASTEP + 1) * 2.78µS`
 *
 * @return The current integration time in ms
 */
long AS_getTINT(ESP32_AS7341 *AS) {
    assert(AS->init==true && NOT_INIT);
    if(AS->mode==AS7341_MODE_SPM || AS->mode==AS7341_MODE_SYNS){
        return (AS->ATIME + 1) * (AS->ASTEP + 1) * 2.78 / 1000;
    }
    else {
        return AS_getITIME(AS) * 2.78 / 1000;
    }
}

/**
 * @brief Returns the ADC Full Scale value
 *
 * The ADC Full Scale value is `(ATIME + 1) * (ASTEP + 1)`
 *
 * @return The current integration time in ms
 */
long AS_getADC_FS(ESP32_AS7341 *AS) {
    assert(AS->init==true && NOT_INIT);
    if(AS->mode==AS7341_MODE_SPM || AS->mode==AS7341_MODE_SYNS){
        return (AS->ATIME + 1) * (AS->ASTEP + 1);
    }
    else {
        return 0; //if SYND mode, return 0
    }
}

/**
 * @brief Converts raw ADC values to basic counts
 *
 * The basic counts are `RAW/(GAIN * TINT)`
 *
 * @param raw The raw ADC values to convert
 *
 * @return float of the basic counts
 */
float AS_toBasicCounts(ESP32_AS7341 *AS, uint16_t raw) {
    assert(AS->init==true && NOT_INIT);
    float gain_val = 0;
    as7341_gain_t gain = AS->gain;
    switch (gain) {
    case AS7341_GAIN_0_5X:
        gain_val = 0.5;
        break;
    case AS7341_GAIN_1X:
        gain_val = 1;
        break;
    case AS7341_GAIN_2X:
        gain_val = 2;
        break;
    case AS7341_GAIN_4X:
        gain_val = 4;
        break;
    case AS7341_GAIN_8X:
        gain_val = 8;
        break;
    case AS7341_GAIN_16X:
        gain_val = 16;
        break;
    case AS7341_GAIN_32X:
        gain_val = 32;
        break;
    case AS7341_GAIN_64X:
        gain_val = 64;
        break;
    case AS7341_GAIN_128X:
        gain_val = 128;
        break;
    case AS7341_GAIN_256X:
        gain_val = 256;
        break;
    case AS7341_GAIN_512X:
        gain_val = 512;
        break;
    }
    return raw / (gain_val * (AS->ATIME + 1) * (AS->ASTEP + 1) * 2.78 / 1000);
}

